[
  {
    "title": "Software Engineer",
    "icon": "code",
    "description": "About Codesmith\n\nCodesmith is a leading enterprise software company focused on building scalable, secure applications that power Fortune 500 businesses worldwide. Our team of passionate engineers works on cutting-edge technologies to solve complex problems.\n\nAbout The Role\n\nWe're seeking a talented Software Engineer to join our Core Platform team in Austin, TX. You'll design, develop, and maintain high-quality software solutions that form the backbone of our product ecosystem. This is a hybrid role with 3 days in office.\n\n$130,000 - $180,000 USD\n\nResponsibilities:\n• Build and maintain scalable backend services using Java and Golang\n• Collaborate with cross-functional teams to implement new features and improve existing ones\n• Participate in code reviews to ensure quality and share knowledge\n• Write automated tests and documentation for all code\n• Troubleshoot production issues and implement fixes\n\nRequirements:\n• Bachelor's degree in Computer Science or equivalent experience\n• 3+ years of professional software development experience\n• Strong knowledge of at least one programming language (Java, Python, or Golang)\n• Experience with distributed systems and microservices architecture\n• Familiarity with AWS or other cloud platforms\n• Strong problem-solving skills and attention to detail\n\nBenefits include competitive health insurance, 401(k) matching, unlimited PTO, and continuous learning opportunities."
  },
  {
    "title": "Frontend Developer",
    "icon": "layout",
    "description": "About Pixel Perfect\n\nPixel Perfect is a fast-growing digital agency specializing in creating beautiful, functional web experiences for clients ranging from startups to established brands. We believe in pushing the boundaries of what's possible on the web.\n\nAbout The Role\n\nWe're looking for a skilled Frontend Developer to join our Engineering team in New York City. You'll create responsive, intuitive user interfaces that delight our clients and their customers. Remote candidates within US time zones are welcome.\n\n$110,000 - $150,000 USD\n\nResponsibilities:\n• Transform design wireframes into functional, responsive web applications\n• Implement UI/UX designs using modern frontend frameworks (React, Vue.js)\n• Optimize applications for maximum speed and scalability\n• Collaborate with designers to ensure high-quality visual implementations\n• Ensure cross-browser compatibility and responsive design principles\n\nRequirements:\n• 2+ years of professional frontend development experience\n• Expert knowledge of HTML, CSS, JavaScript, and TypeScript\n• Experience with React or Vue.js and related ecosystem tools\n• Understanding of web performance optimization and responsive design\n• Knowledge of modern build tools (Webpack, Vite, etc.)\n• Portfolio demonstrating previous work\n\nWe offer comprehensive health benefits, flexible working hours, professional development budget, and a collaborative, creative environment."
  },
  {
    "title": "Backend Developer",
    "icon": "database",
    "description": "About DataFlow\n\nDataFlow is a cloud-native platform helping businesses make data-driven decisions through powerful analytics and insights. Our backend infrastructure processes petabytes of data for thousands of clients daily.\n\nAbout The Role\n\nJoin our team as a Backend Developer to build and maintain the server-side logic that powers our high-traffic applications. Based in Seattle, WA with flexible remote options available.\n\n$140,000 - $190,000 USD\n\nResponsibilities:\n• Design and develop scalable APIs and microservices using Node.js and Python\n• Integrate with various database systems and optimize query performance\n• Implement security best practices and ensure data privacy compliance\n• Create and maintain comprehensive API documentation\n• Collaborate with frontend teams to define interfaces and data structures\n\nRequirements:\n• 4+ years experience in backend development\n• Proficiency in Node.js, Python, or similar server-side technologies\n• Strong knowledge of SQL and NoSQL databases\n• Experience with message queues and event-driven architectures\n• Understanding of security practices and data protection\n• BS/MS in Computer Science or equivalent experience\n\nBenefits include competitive salary, generous equity package, comprehensive health benefits, 401(k) matching, remote work flexibility, and regular team retreats."
  },
  {
    "title": "Full Stack Developer",
    "icon": "layers",
    "description": "About Omnisys\n\nOmnisys provides integrated enterprise solutions that streamline operations for businesses across healthcare, finance, and manufacturing sectors. Our full-stack approach ensures seamless experiences across all platforms.\n\nAbout The Role\n\nWe're looking for a versatile Full Stack Developer to join our product development team in Chicago, IL. You'll build complete web applications from database design to user interface implementation. This is a hybrid position (2 days in office).\n\n$125,000 - $175,000 USD\n\nResponsibilities:\n• Develop and maintain web applications using React and Node.js\n• Design and implement database schemas in PostgreSQL\n• Build RESTful APIs and GraphQL endpoints\n• Ensure application security and performance optimization\n• Participate in the full software development lifecycle\n\nRequirements:\n• 3+ years of full stack development experience\n• Strong knowledge of JavaScript/TypeScript, HTML, and CSS\n• Experience with React, Angular, or Vue on the frontend\n• Backend experience with Node.js, Express, or similar frameworks\n• Familiarity with database design and ORM tools\n• Understanding of CI/CD pipelines and deployment strategies\n\nBenefits include health, dental, and vision insurance, flexible PTO policy, continuous learning budget, and option to work remotely 3 days per week."
  },
  {
    "title": "DevOps Engineer",
    "icon": "git-branch",
    "description": "About CloudScale\n\nCloudScale is a leading provider of cloud infrastructure automation solutions, helping enterprises optimize their cloud operations and reduce costs. Our platform is trusted by over 500 companies worldwide.\n\nAbout The Role\n\nWe're seeking a DevOps Engineer to join our Platform Engineering team in Denver, CO. You'll implement CI/CD pipelines, manage cloud infrastructure, and optimize system performance. Remote candidates in the US are welcome.\n\n$140,000 - $190,000 USD\n\nResponsibilities:\n• Design and implement robust CI/CD pipelines for our software delivery\n• Manage and optimize cloud infrastructure on AWS, GCP, and Azure\n• Implement infrastructure as code using Terraform and CloudFormation\n• Build monitoring solutions and respond to production incidents\n• Collaborate with development teams to improve deployment processes\n\nRequirements:\n• 4+ years experience in DevOps, SRE, or similar roles\n• Strong knowledge of Linux/Unix systems administration\n• Experience with containerization (Docker) and orchestration (Kubernetes)\n• Proficiency with at least one cloud provider (AWS, GCP, Azure)\n• Knowledge of infrastructure as code tools (Terraform, Pulumi)\n• Experience with monitoring and observability platforms\n\nWe offer competitive compensation, excellent benefits, flexible work arrangements, professional development opportunities, and an inclusive work culture."
  },
  {
    "title": "Data Scientist",
    "icon": "bar-chart",
    "description": "About Datanova\n\nDatanova is an AI-driven analytics platform that transforms complex data into actionable business insights. Our solutions are used by Fortune 100 companies to drive strategic decision-making across their organizations.\n\nAbout The Role\n\nJoin us as a Data Scientist to extract insights from complex datasets and develop predictive models that solve real business problems. Based in Boston, MA with hybrid work model (minimum 2 days in office).\n\n$150,000 - $200,000 USD\n\nResponsibilities:\n• Analyze large datasets to identify patterns and extract valuable insights\n• Develop and deploy machine learning models for business applications\n• Work with stakeholders to understand business needs and translate them into data science solutions\n• Create visualizations and reports to communicate findings effectively\n• Collaborate with engineering teams to implement models in production\n\nRequirements:\n• Master's or PhD in Statistics, Computer Science, or related quantitative field\n• 3+ years experience in applied data science or machine learning\n• Strong programming skills in Python with experience using data science libraries\n• Experience with statistical modeling, machine learning, and deep learning techniques\n• Proficiency in SQL and data processing at scale\n• Excellent communication and presentation skills\n\nBenefits include competitive salary, stock options, health/dental/vision coverage, 401(k) with employer match, continuous learning stipend, and flexible work arrangements."
  },
  {
    "title": "Data Engineer",
    "icon": "database-backup",
    "description": "About Streamline Data\n\nStreamline Data is a data infrastructure company helping organizations build robust data pipelines and warehousing solutions. Our platform processes over 10 petabytes of data monthly for clients across various industries.\n\nAbout The Role\n\nWe are looking for a Data Engineer to build and maintain our data infrastructure. Based in Atlanta, GA with remote options available.\n\n$130,000 - $180,000 USD\n\nResponsibilities:\n• Design and implement scalable data pipelines for batch and streaming data\n• Develop ETL processes for data transformation and integration\n• Optimize database performance and query efficiency\n• Collaborate with data scientists to productionize machine learning models\n• Implement data quality checks and monitoring systems\n\nRequirements:\n• Bachelor's degree in Computer Science, Engineering, or related field\n• 3+ years experience in data engineering roles\n• Proficiency in Python and SQL\n• Experience with data processing frameworks (Spark, Kafka, Airflow)\n• Knowledge of cloud data warehousing solutions (Snowflake, BigQuery, Redshift)\n• Understanding of data modeling and database optimization\n\nWe offer a comprehensive benefits package including health insurance, 401(k) matching, flexible PTO, home office stipend, and professional development opportunities."
  },
  {
    "title": "Product Manager",
    "icon": "briefcase",
    "description": "About InnovateTech\n\nInnovateTech is a SaaS company providing workflow automation solutions that transform how enterprises manage their operations. Our platform serves over 2,000 companies globally, including 30% of the Fortune 500.\n\nAbout The Role\n\nSeeking an experienced Product Manager to drive the development of our flagship automation platform. This position is based in Austin, TX with flexible working arrangements (2-3 days in office weekly).\n\n$140,000 - $190,000 USD\n\nResponsibilities:\n• Define product strategy and roadmap based on market trends and customer feedback\n• Gather and prioritize product requirements from stakeholders and customers\n• Create detailed product specifications and user stories for engineering teams\n• Collaborate with design and engineering teams throughout the development lifecycle\n• Track product KPIs and ensure features deliver expected business outcomes\n• Present product updates to executives and external stakeholders\n\nRequirements:\n• 5+ years of product management experience in B2B SaaS products\n• Experience leading cross-functional teams through product development cycles\n• Strong analytical skills and data-driven decision making\n• Excellent communication and presentation abilities\n• Technical background or ability to understand complex technical concepts\n• Bachelor's degree in business, engineering, or related field\n\nBenefits include competitive salary, equity compensation, comprehensive health benefits, 401(k) matching, unlimited PTO, and professional development allowance."
  },
  {
    "title": "UX/UI Designer",
    "icon": "palette",
    "description": "About DesignForward\n\nDesignForward is a design-led technology company creating digital products that millions of people use daily. Our award-winning design team has been recognized by Fast Company and IDEO for innovation excellence.\n\nAbout The Role\n\nJoin our team as a UX/UI Designer to create beautiful, intuitive interfaces that delight users. Based in San Francisco, CA with flexible hybrid arrangements.\n\n$120,000 - $160,000 USD\n\nResponsibilities:\n• Create wireframes, prototypes, and high-fidelity designs for web and mobile applications\n• Conduct user research and usability testing to inform design decisions\n• Develop user flows and journey maps to optimize the user experience\n• Collaborate with product and engineering teams to implement designs\n• Maintain and evolve our design system to ensure consistency\n• Stay current with UX trends and best practices\n\nRequirements:\n• 3+ years of professional UX/UI design experience\n• Strong portfolio demonstrating user-centered design process\n• Proficiency with Figma, Sketch, Adobe XD, or similar design tools\n• Experience conducting user research and usability testing\n• Understanding of accessibility standards and inclusive design principles\n• Excellent visual design skills with attention to typography, color, and layout\n\nBenefits include competitive salary, equity options, comprehensive health coverage, 401(k) with matching, unlimited PTO, continuing education allowance, and design conference budget."
  },
  {
    "title": "QA Engineer",
    "icon": "test-tube",
    "description": "About QualityFirst\n\nQualityFirst develops testing automation solutions used by development teams worldwide to ensure software reliability. Our platform handles over 2 million test executions daily across thousands of customer applications.\n\nAbout The Role\n\nWe're looking for a QA Engineer to ensure the quality of our software products. This position is based in Raleigh, NC with remote options available.\n\n$110,000 - $150,000 USD\n\nResponsibilities:\n• Develop and execute comprehensive test plans and test cases\n• Create and maintain automated test scripts using Selenium, Cypress, or similar tools\n• Perform manual testing when necessary for exploratory and usability testing\n• Identify, document, and track bugs through resolution\n• Collaborate with developers to improve overall software quality\n• Participate in agile ceremonies and provide quality-related insights\n\nRequirements:\n• 3+ years experience in software quality assurance\n• Strong knowledge of QA methodologies and best practices\n• Experience with test automation frameworks and tools\n• Familiarity with CI/CD pipelines and testing integration\n• Basic programming skills in Python, JavaScript, or similar languages\n• ISTQB certification preferred\n\nWe offer competitive compensation, comprehensive benefits package, flexible work arrangements, professional development opportunities, and a collaborative work environment focused on continuous improvement."
  },
  {
    "title": "Machine Learning Engineer",
    "icon": "brain",
    "description": "About Cognify AI\n\nCognify AI is at the forefront of artificial intelligence research and application, delivering cutting-edge ML solutions for healthcare, finance, and retail industries. Our models process billions of predictions daily for enterprise clients.\n\nAbout The Role\n\nSeeking a Machine Learning Engineer to develop and deploy intelligent systems that solve complex business problems. This role is based in our Cambridge, MA office with hybrid options (minimum 2 days in office).\n\n$160,000 - $220,000 USD\n\nResponsibilities:\n• Design and implement machine learning algorithms for production systems\n• Build efficient data pipelines for training and serving ML models\n• Deploy models to production and ensure reliable inference at scale\n• Collaborate with data scientists to implement research into production\n• Monitor model performance and implement improvements\n• Stay current with ML research and evaluate new techniques\n\nRequirements:\n• Master's or PhD in Computer Science, Machine Learning, or related field\n• 3+ years experience building and deploying ML models to production\n• Strong programming skills in Python and proficiency with ML frameworks\n• Experience with model serving infrastructure and monitoring\n• Knowledge of distributed computing for large-scale ML workloads\n• Understanding of ML operations best practices\n\nBenefits include competitive salary, equity package, premium health coverage, 401(k) matching, flexible work hours, continuous learning budget, and conference attendance."
  },
  {
    "title": "Cloud Architect",
    "icon": "cloud",
    "description": "About CloudMatrix\n\nCloudMatrix is a leading cloud consulting and solutions provider helping enterprises modernize their infrastructure and applications. We've successfully guided over 300 major cloud migrations and optimizations.\n\nAbout The Role\n\nJoin us as a Cloud Architect to design and implement cloud infrastructure strategies for our enterprise clients. Based in Chicago, IL with 40% travel to client sites.\n\n$170,000 - $230,000 USD\n\nResponsibilities:\n• Design scalable, secure, and resilient cloud architectures\n• Lead technical discussions with clients to understand requirements\n• Create cloud adoption roadmaps and migration strategies\n• Implement infrastructure as code for automated deployments\n• Optimize cloud costs and performance for client environments\n• Stay current with cloud service provider offerings and best practices\n\nRequirements:\n• 7+ years experience in IT infrastructure, with 4+ years in cloud technologies\n• Deep expertise in at least one major cloud platform (AWS, Azure, GCP)\n• Experience with multi-cloud and hybrid cloud architectures\n• Strong knowledge of network design, security, and compliance\n• Familiarity with containers, serverless, and microservices\n• Professional certifications (AWS Solutions Architect, Azure Solutions Architect, GCP Professional Cloud Architect)\n\nBenefits include competitive base salary, performance bonuses, comprehensive health benefits, 401(k) with generous matching, professional development budget, and home office allowance."
  },
  {
    "title": "Mobile Developer",
    "icon": "smartphone",
    "description": "About AppSphere\n\nAppSphere creates award-winning mobile applications that have been featured in the Apple App Store and Google Play Store. Our consumer and enterprise apps have over 50 million combined downloads worldwide.\n\nAbout The Role\n\nWe are seeking a Mobile Developer to build innovative applications for iOS and Android platforms. Based in our Los Angeles, CA headquarters with remote options available.\n\n$130,000 - $180,000 USD\n\nResponsibilities:\n• Design and develop feature-rich applications for iOS and/or Android\n• Write clean, maintainable code following platform-specific best practices\n• Implement responsive UI components and integrate with backend services\n• Optimize applications for performance and battery efficiency\n• Identify and fix bugs and performance bottlenecks\n• Collaborate with designers and product managers to deliver great user experiences\n\nRequirements:\n• 3+ years of professional mobile development experience\n• Expert knowledge of Swift/Objective-C for iOS or Kotlin/Java for Android\n• Experience with cross-platform frameworks like React Native or Flutter\n• Understanding of mobile app architecture patterns\n• Familiarity with RESTful APIs and JSON\n• Published apps in the App Store or Google Play Store\n\nWe offer competitive salary, equity options, health/dental/vision coverage, 401(k) matching, unlimited PTO, latest development hardware, and regular team events."
  },
  {
    "title": "Security Engineer",
    "icon": "shield",
    "description": "About CyberShield\n\nCyberShield is a cybersecurity company providing enterprise-grade security solutions to protect organizations from evolving digital threats. Our platform secures over 500 enterprises, including several Fortune 100 companies.\n\nAbout The Role\n\nLooking for a Security Engineer to protect our systems and data from threats. This position is based in Arlington, VA with flexible remote options.\n\n$150,000 - $200,000 USD\n\nResponsibilities:\n• Implement and maintain security controls across cloud and on-premise environments\n• Conduct vulnerability assessments and penetration testing\n• Respond to security incidents and lead remediation efforts\n• Develop and enforce security policies and procedures\n• Implement automation for security monitoring and compliance\n• Stay current with emerging threats and security technologies\n\nRequirements:\n• 5+ years experience in information security or related field\n• Strong knowledge of network security, encryption, and identity management\n• Experience with security tools (SIEM, EDR, vulnerability scanners)\n• Familiarity with compliance frameworks (SOC2, GDPR, HIPAA, PCI DSS)\n• Understanding of cloud security architectures and controls\n• Security certifications (CISSP, CEH, Security+) preferred\n• Active security clearance a plus\n\nBenefits include competitive compensation, comprehensive benefits package, continuing education allowance, certification reimbursement, and flexible work arrangements."
  },
  {
    "title": "Technical Product Manager",
    "icon": "clipboard-list",
    "description": "About TechFusion\n\nTechFusion builds enterprise workflow management solutions that integrate with legacy systems to modernize operations. Our platform is used by major organizations in healthcare, finance, and manufacturing sectors.\n\nAbout The Role\n\nSeeking a Technical Product Manager to bridge the gap between technical and business teams, guiding the development of our integration platform. Based in our Seattle, WA office with hybrid work model (3 days in office).\n\n$140,000 - $190,000 USD\n\nResponsibilities:\n• Translate business requirements into detailed technical specifications\n• Collaborate with engineering teams to define architecture and implementation approaches\n• Manage product backlogs and prioritize features based on business impact\n• Create comprehensive product documentation and technical guides\n• Coordinate with customer success teams to gather feedback and identify pain points\n• Present technical concepts to stakeholders in clear, understandable terms\n\nRequirements:\n• 4+ years of product management experience with technical products\n• Background in software development or engineering\n• Experience with API-driven products and integration platforms\n• Strong understanding of enterprise software ecosystems\n• Excellent communication skills and ability to explain complex concepts\n• Bachelor's degree in Computer Science, Engineering, or related field\n\nBenefits include competitive salary, equity package, premium health benefits, 401(k) matching, flexible PTO, professional development budget, and wellness programs."
  },
  {
    "title": "Site Reliability Engineer",
    "icon": "cpu",
    "description": "About ReliableSys\n\nReliableSys provides infrastructure monitoring and management solutions that ensure critical systems remain operational 24/7. Our platform handles over 10 million checks per minute across thousands of customer environments.\n\nAbout The Role\n\nJoin our team as a Site Reliability Engineer to ensure our systems remain available, scalable, and efficient. This role is based in our New York City office with remote options available.\n\n$150,000 - $200,000 USD\n\nResponsibilities:\n• Design and implement automation to manage complex distributed systems\n• Monitor system performance and optimize for reliability and efficiency\n• Develop and maintain infrastructure as code using Terraform and Ansible\n• Participate in on-call rotations to address production incidents\n• Implement observability solutions for comprehensive system monitoring\n• Collaborate with development teams to improve application reliability\n\nRequirements:\n• 4+ years experience in systems administration or operations roles\n• Strong programming skills in Python, Go, or similar languages\n• Experience with Linux/Unix environments and containerization (Docker, Kubernetes)\n• Knowledge of monitoring systems (Prometheus, Grafana, Datadog)\n• Understanding of networking, load balancing, and distributed systems\n• Experience with public cloud platforms (AWS, GCP, Azure)\n\nWe offer competitive compensation, comprehensive benefits, flexible work arrangements, on-call compensation, continuous learning opportunities, and a collaborative work environment."
  },
  {
    "title": "Database Administrator",
    "icon": "database-cog",
    "description": "About DataCore\n\nDataCore specializes in database management solutions that optimize performance and ensure data integrity for mission-critical applications. Our tools and services support over 5,000 database installations worldwide.\n\nAbout The Role\n\nWe're looking for a Database Administrator to manage and optimize our database systems. This position is based in Dallas, TX with hybrid work options.\n\n$130,000 - $180,000 USD\n\nResponsibilities:\n• Design, implement, and maintain database structures for optimal performance\n• Develop and execute backup and recovery procedures\n• Monitor database performance and implement optimization strategies\n• Ensure database security and compliance with data protection regulations\n• Manage upgrades, patches, and migrations with minimal disruption\n• Provide expertise on database technologies to development teams\n\nRequirements:\n• 5+ years experience in database administration\n• Expert knowledge of relational databases (Oracle, SQL Server, PostgreSQL)\n• Experience with NoSQL databases (MongoDB, Cassandra, Redis)\n• Understanding of high availability and disaster recovery strategies\n• Knowledge of data modeling and query optimization techniques\n• Database certifications (Oracle, Microsoft, MongoDB) preferred\n\nBenefits include competitive salary, comprehensive health benefits, 401(k) with matching, flexible work schedule, professional development allowance, and certification reimbursement."
  },
  {
    "title": "Systems Analyst",
    "icon": "trending-up",
    "description": "About SysCorp\n\nSysCorp provides enterprise system integration and business process optimization solutions for large organizations. We've successfully completed over 500 digital transformation projects for Fortune 1000 companies.\n\nAbout The Role\n\nSeeking a Systems Analyst to evaluate business requirements and translate them into system specifications. Based in Minneapolis, MN with hybrid work arrangement (2 days in office).\n\n$110,000 - $150,000 USD\n\nResponsibilities:\n• Analyze existing systems and identify opportunities for improvement\n• Gather and document business requirements from stakeholders\n• Translate business needs into functional and technical specifications\n• Create process flows, use cases, and requirements documentation\n• Collaborate with development teams during implementation\n• Validate system changes meet business requirements\n\nRequirements:\n• 3+ years experience in systems analysis or business analysis\n• Strong understanding of business processes and system integration\n• Experience with requirements gathering techniques and documentation\n• Knowledge of database concepts and data modeling\n• Familiarity with agile development methodologies\n• Bachelor's degree in Information Systems, Computer Science, or related field\n\nWe offer competitive compensation, comprehensive benefits package, flexible work arrangements, professional development opportunities, and a collaborative work environment."
  },
  {
    "title": "Technical Writer",
    "icon": "file-text",
    "description": "About DocuTech\n\nDocuTech specializes in technical documentation solutions for software companies. Our platform helps development teams create, manage, and deliver comprehensive technical documentation.\n\nAbout The Role\n\nJoin us as a Technical Writer to create clear, concise documentation for our technical products. This position is remote-friendly with occasional visits to our Portland, OR headquarters.\n\n$100,000 - $140,000 USD\n\nResponsibilities:\n• Create user guides, API documentation, and developer tutorials\n• Collaborate with engineers to understand complex technical concepts\n• Develop and maintain documentation style guides and templates\n• Review and edit content created by subject matter experts\n• Implement documentation best practices across the organization\n• Use analytics to identify gaps and improve documentation quality\n\nRequirements:\n• 3+ years experience in technical writing for software products\n• Strong writing skills with ability to explain complex concepts clearly\n• Experience with documentation tools (Markdown, Sphinx, Confluence)\n• Familiarity with API documentation standards (OpenAPI, Swagger)\n• Understanding of software development processes\n• Bachelor's degree in English, Technical Communication, or related field\n\nBenefits include competitive salary, health/dental/vision coverage, 401(k) matching, flexible work schedule, home office stipend, and professional development opportunities."
  },
  {
    "title": "Scrum Master",
    "icon": "compass",
    "description": "About AgilePrime\n\nAgilePrime provides agile coaching and consulting services to help organizations transform their development processes. We've trained over 10,000 professionals in agile methodologies and implemented successful agile transformations at 200+ companies.\n\nAbout The Role\n\nWe are looking for a Scrum Master to facilitate agile development processes and coach teams on agile practices. This position is hybrid, based in our Washington, DC office.\n\n$120,000 - $160,000 USD\n\nResponsibilities:\n• Facilitate daily standups, sprint planning, reviews, and retrospectives\n• Remove impediments that block team progress\n• Coach teams on agile principles and practices\n• Track and report on team metrics and continuous improvement\n• Collaborate with Product Owners to manage backlogs and priorities\n• Support organizations in their agile transformation journey\n\nRequirements:\n• 4+ years experience in agile environments\n• Certified Scrum Master (CSM) or Professional Scrum Master (PSM) certification\n• Experience working with software development teams\n• Strong facilitation and conflict resolution skills\n• Knowledge of various agile frameworks (Scrum, Kanban, SAFe)\n• Excellent communication and coaching abilities\n\nWe offer competitive salary, performance bonuses, comprehensive benefits, flexible work arrangements, certification reimbursement, and professional development opportunities."
  }
]
